# LineColor Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
WorksharingDisplayGraphicSettings..::..LineColor Property
WorksharingDisplayGraphicSettings Class See Also
---
The line color that will be applied to elements when these settings are applied.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public Color LineColor { get; }
```

Visual Basic
---
```text
Public ReadOnly Property LineColor As Color
	Get
```

Visual C++
---
```text
public:
property Color^ LineColor {
	Color^ get ();
}
```

# See Also
WorksharingDisplayGraphicSettings Class
Autodesk.Revit.DB Namespace